espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/util/process-global-message.c
/***************************************************************************//**
 * @file
 * @brief This file contains function that processes global ZCL message.
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

#include "sl_common.h"

#ifdef UC_BUILD
#include "af.h"
#include "sl_component_catalog.h"
#include "common.h"
#ifdef SL_CATALOG_ZIGBEE_IAS_ZONE_CLIENT_PRESENT
#include "ias-zone-client.h"
#define IAS_ZONE_CLIENT_PRESENT
#endif
#ifdef SL_CATALOG_ZIGBEE_KEY_ESTABLISHMENT_PRESENT
#include "key-establishment.h"
#define KEY_ESTABLISHMENT_PRESENT
#endif
#ifdef SL_CATALOG_ZIGBEE_SMART_ENERGY_REGISTRATION_PRESENT
#include "smart-energy-registration.h"
#endif
#ifdef SL_CATALOG_ZIGBEE_TRUST_CENTER_KEEPALIVE_PRESENT
#include "trust-center-keepalive.h"
#define TRUST_CENTER_KEEPALIVE_PRESENT
#endif
#ifdef SL_CATALOG_ZIGBEE_TEST_HARNESS_PRESENT
#include "test-harness.h"
#define TEST_HARNESS_PRESENT
#endif
#ifdef SL_CATALOG_ZIGBEE_WWAH_SERVER_SILABS_PRESENT
#include "wwah-server-silabs.h"
#define WWAH_SERVER_SILABS_PRESENT
#endif
#ifdef SL_CATALOG_ZIGBEE_COMMS_HUB_FUNCTION_SUB_GHZ_PRESENT
#include "comms-hub-function-sub-ghz.h"
#define COMMS_HUB_FUNCTION_SUB_GHZ_PRESENT
#endif
#ifdef SL_CATALOG_ZIGBEE_SIMPLE_METERING_SERVER_PRESENT
#include "simple-metering-server.h"
#define SIMPLE_METERING_SERVER_PRESENT
#endif
#include "zigbee_zcl_callback_dispatcher.h" // emAfRetrieveAttributeAndCraftResponse
#ifdef SL_CATALOG_ZIGBEE_GBCS_COMPATIBILITY_PRESENT
#define GBCS_COMPATIBILITY_PRESENT
#endif
#else // !UC_BUILD
#include "../include/af.h"
#include "common.h"
#include "../plugin/ias-zone-client/ias-zone-client.h"
#ifdef EMBER_AF_PLUGIN_IAS_ZONE_CLIENT
#define IAS_ZONE_CLIENT_PRESENT
#endif
#include "../plugin/key-establishment/key-establishment.h"
#ifdef EMBER_AF_PLUGIN_KEY_ESTABLISHMENT
#define KEY_ESTABLISHMENT_PRESENT
#endif
#include "../plugin/smart-energy-registration/smart-energy-registration.h"
#include "../plugin/trust-center-keepalive/trust-center-keepalive.h"
#ifdef EMBER_AF_PLUGIN_TRUST_CENTER_KEEPALIVE
#define TRUST_CENTER_KEEPALIVE_PRESENT
#endif
#include "../plugin/test-harness/test-harness.h"
#ifdef EMBER_AF_PLUGIN_TEST_HARNESS
#define TEST_HARNESS_PRESENT
#endif
#ifdef EMBER_AF_PLUGIN_WWAH_SERVER_SILABS
#include "../plugin/wwah-server-silabs/wwah-server-silabs.h"
#define WWAH_SERVER_SILABS_PRESENT
#endif
#ifdef EMBER_AF_PLUGIN_COMMS_HUB_FUNCTION_SUB_GHZ
#include "app/framework/plugin/comms-hub-function-sub-ghz/comms-hub-function-sub-ghz.h"
#define COMMS_HUB_FUNCTION_SUB_GHZ_PRESENT
#endif
#include "../plugin/simple-metering-server/simple-metering-server.h"
#ifdef EMBER_AF_PLUGIN_SIMPLE_METERING_SERVER
#define SIMPLE_METERING_SERVER_PRESENT
#endif
#include "znet-bookkeeping.h" // emAfRetrieveAttributeAndCraftResponse
#ifdef EMBER_AF_PLUGIN_GBCS_COMPATIBILITY
#define GBCS_COMPATIBILITY_PRESENT
#endif
#endif // UC_BUILD

// flag to keep track of the fact that we just sent a read attr for time and
// we should set our time to the result of the read attr response.
bool emAfSyncingTime = false;

#ifdef GBCS_COMPATIBILITY_PRESENT
// Some GBCS use cases (e.g. GCS15e, GCS21f) require that ReadAttributesResponse
// should be send back with Disable Default Response flag set. The only pattern
// is that the decision is based on the cluster and attribute IDs requested.
// To reduce the possibility of false positives, we disable default response
// only for responses containing at least the specified minimum of attributes.
#define MIN_MATCHING_ATTR_IDS_TO_DISABLE_DEFAULT_RESPONSE       3
#endif

#define DISC_ATTR_RSP_MAX_ATTRIBUTES                                         \
  (((EMBER_AF_MAXIMUM_APS_PAYLOAD_LENGTH                                     \
     - EMBER_AF_ZCL_MANUFACTURER_SPECIFIC_OVERHEAD /* max ZCL header size */ \
     - 1)       /* discovery is complete bool */                             \
    / 3)        /* size of one discover attributes response entry */         \
   % UINT8_MAX) /* make count fit in an 8 bit integer */
#define DISC_ATTR_EXT_RSP_MAX_ATTRIBUTES                                      \
  (((EMBER_AF_MAXIMUM_APS_PAYLOAD_LENGTH                                      \
     - EMBER_AF_ZCL_MANUFACTURER_SPECIFIC_OVERHEAD /* max ZCL header size */  \
     - 1)       /* discovery is complete bool */                              \
    / 4)        /* size of one discover attributes extended response entry */ \
   % UINT8_MAX) /* make count fit in an 8 bit integer */

#if defined(EMBER_AF_SUPPORT_COMMAND_DISCOVERY)
static void printDiscoverCommandsResponse(bool generated,
                                          uint16_t clusterId,
                                          bool discoveryComplete,
                                          uint8_t* buffer,
                                          uint16_t length)
{
  uint16_t i;
  emberAfServiceDiscoveryPrint("Discover Commands response (complete: %c), %p IDs: ",
                               (discoveryComplete
                                ? 'y'
                                : 'n'),
                               (generated
                                ? "Generated"
                                : "Received"));
  for (i = 0; i < length; i++) {
    emberAfServiceDiscoveryPrint("0x%X ", buffer[i]);
  }
  emberAfServiceDiscoveryPrintln("");
}
#endif

bool emAfProcessGlobalCommand(EmberAfClusterCommand *cmd)
{
  uint16_t attrId;
  uint8_t frameControl;
  uint8_t *mfgCodePtr = NULL;
  // This is a little clumsy but easier to read and port
  // from earlier implementation.
  EmberAfClusterId clusterId = cmd->apsFrame->clusterId;
  uint8_t zclCmd = cmd->commandId;
  uint8_t *message = cmd->buffer;
  uint16_t msgLen = cmd->bufLen;
  uint16_t msgIndex = cmd->payloadStartIndex;
  uint8_t clientServerMask = (cmd->direction == ZCL_DIRECTION_CLIENT_TO_SERVER
                              ? CLUSTER_MASK_SERVER
                              : CLUSTER_MASK_CLIENT);

  // If we are disabled then we can only respond to read or write commands
  // or identify cluster (see device enabled attr of basic cluster)
  if (!emberAfIsDeviceEnabled(cmd->apsFrame->destinationEndpoint)
      && zclCmd != ZCL_READ_ATTRIBUTES_COMMAND_ID
      && zclCmd != ZCL_WRITE_ATTRIBUTES_COMMAND_ID
      && zclCmd != ZCL_WRITE_ATTRIBUTES_UNDIVIDED_COMMAND_ID
      && zclCmd != ZCL_WRITE_ATTRIBUTES_NO_RESPONSE_COMMAND_ID
      && clusterId != ZCL_IDENTIFY_CLUSTER_ID) {
    emberAfCorePrintln("disabled");
    emberAfDebugPrintln("%pd, dropping global cmd:%x", "disable", zclCmd);
    emberAfSendDefaultResponse(cmd, EMBER_ZCL_STATUS_FAILURE);
    return true;
  }

