espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/util/process-global-message.c
        // Check to see if there are dataSize bytes available in the message
        if (dataSize == 0u) {
          // This command is malformed
          status = EMBER_ZCL_STATUS_MALFORMED_COMMAND;
        } else {
          status = emberAfVerifyAttributeWrite(cmd->apsFrame->destinationEndpoint,
                                               clusterId,
                                               attrId,
                                               clientServerMask,
                                               cmd->mfgCode,
                                               &(message[msgIndex + 3u]),
                                               dataType);
        }

        if (status != EMBER_ZCL_STATUS_SUCCESS) {
          numFailures++;
          // Write to the response buffer - status and then attrID
          (void) emberAfPutInt8uInResp(status);
          (void) emberAfPutInt16uInResp(attrId);

          emberAfAttributesPrintln("WRITE: clus %2x attr %2x ", clusterId, attrId);
          emberAfAttributesPrintln("FAIL %x", status);
          emberAfCoreFlush();
          if (status == EMBER_ZCL_STATUS_MALFORMED_COMMAND) {
            // this attribute is malformed, terminate attribute processing.
            break;
          }
        }

        // Increment past the attribute id (two bytes), the type (one byte), and
        // the data (N bytes, including the length byte for strings).
        msgIndex += 3u + dataSize;
      }
      // If there are any failures, send the response and exit
      if (numFailures > 0u) {
        emberAfSendResponse();
        return true;
      }
    }
      // Reset message back to start
      msgIndex = cmd->payloadStartIndex;
      appResponseLength = (cmd->mfgSpecific ? 4u : 2u);
      SL_FALLTHROUGH
    // DO NOT BREAK from this case

    // the format of the write attributes cmd is:
    // ([attr ID:2] [data type:1] [data:N]) * N
    // the format of the write attributes response is:
    // ([status 1] [attr ID 2]) * n
    // ONLY errors are reported unless all are successful then a single success
    // is sent. write attr no response is handled by just executing the same
    // code but not setting the flag that sends the response at the end.
    case ZCL_WRITE_ATTRIBUTES_NO_RESPONSE_COMMAND_ID:
    case ZCL_WRITE_ATTRIBUTES_COMMAND_ID:
    {
      uint8_t numFailures = 0;
      uint8_t numSuccess = 0;
      uint8_t dataType;
      uint16_t dataSize;
#if (BIGENDIAN_CPU)
      uint8_t writeData[ATTRIBUTE_LARGEST];
#endif //(BIGENDIAN_CPU)
      EmberAfStatus status;

      // set the cmd byte - this is byte 3 index 2, but since we have
      // already incremented past the 3 byte ZCL header (our index is at 3),
      // this gets written to "-1" since 3 - 1 = 2.
      (void) emberAfPutInt8uInResp(ZCL_WRITE_ATTRIBUTES_RESPONSE_COMMAND_ID);

      // go through the message until there are no more attrID/type/data
      while (msgLen > msgIndex + 3u) {
        attrId = emberAfGetInt16u(message, msgIndex, msgLen);
        dataType = emberAfGetInt8u(message, msgIndex + 2u, msgLen);

        dataSize = emberAfAttributeValueSize(dataType,
                                             message + msgIndex + 3,
                                             msgLen - (msgIndex + 3u));

        // the data is sent little endian over-the-air, it needs to be
        // inserted into the table big endian for the EM250 and little
        // endian for the EZSP hosts. This means for the EM250 the data
        // needs to be reversed before sending to writeAttributes
#if (BIGENDIAN_CPU)
        if (dataSize != 0 && dataSize <= ATTRIBUTE_LARGEST) {
          // strings go over the air as length byte and then in human
          // readable format. These should not be flipped.
          if (emberAfIsThisDataTypeAStringType(dataType)) {
            MEMMOVE(writeData, message + msgIndex + 3, dataSize);
          } else {
            // the data is sent little endian over-the-air, it needs to be
            // inserted into the table big endian
            uint16_t i;
            for (i = 0; i < dataSize; i++) {
              writeData[i] = message[msgIndex + 3 + dataSize - i - 1];
            }
          }
#else //(BIGENDIAN_CPU)
        if (dataSize != 0u) {
#endif //(BIGENDIAN_CPU)

          status = emberAfWriteAttributeExternal(cmd->apsFrame->destinationEndpoint,
                                                 clusterId,
                                                 attrId,
                                                 clientServerMask,
                                                 cmd->mfgCode,
  #if (BIGENDIAN_CPU)
                                                 writeData,
  #else //(BIGENDIAN_CPU)
                                                 &(message[msgIndex + 3u]),
  #endif //(BIGENDIAN_CPU)
                                                 dataType);
          emberAfAttributesPrint("WRITE: clus %2x attr %2x ",
                                 clusterId,
                                 attrId);
          if (status == EMBER_ZCL_STATUS_SUCCESS) {
            numSuccess++;
            emberAfAttributesPrintln("OK");
          } else {
            numFailures++;
            // write to the response buffer - status and then attrID
            (void) emberAfPutInt8uInResp(status);
            (void) emberAfPutInt16uInResp(attrId);
            emberAfAttributesPrintln("FAIL %x", status);
          }
          emberAfCoreFlush();

          // Increment past the attribute id (two bytes), the type (one byte), and
          // the data (N bytes, including the length byte for strings).
          msgIndex += 3u + dataSize;
        } else {
          numFailures++;
          status = EMBER_ZCL_STATUS_INVALID_VALUE;
          // write to the response buffer - status and then attrID
          (void) emberAfPutInt8uInResp(status);
          (void) emberAfPutInt16uInResp(attrId);
          emberAfAttributesPrintln("FAIL %x", status);
          // size exceeds buffer, terminate loop
          break;
        }
      }

