espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/util/process-global-message.c
      // always send a response unless the cmd requested no response
      if (zclCmd == ZCL_WRITE_ATTRIBUTES_NO_RESPONSE_COMMAND_ID) {
        return true;
      }

      if (numFailures == 0u) {
        // if no failures and no success this means the packet was too short
        // print an error message but still return true as we consumed the
        // message
        if (numSuccess == 0u) {
          emberAfAttributesPrintln("WRITE: too short");
          emberAfSendDefaultResponse(cmd, EMBER_ZCL_STATUS_MALFORMED_COMMAND);
          return true;
        }
        // if no failures and at least one success, write a success status
        // that means everything worked
        else {
          (void) emberAfPutInt8uInResp(EMBER_ZCL_STATUS_SUCCESS);
        }
      }
      emberAfSendResponse();
      return true;
    }

    // the format of discover is: [start attr ID:2] [max attr IDs:1]
    // the format of the response is: [done:1] ([attrID:2] [type:1]) * N
    case ZCL_DISCOVER_ATTRIBUTES_COMMAND_ID:
    case ZCL_DISCOVER_ATTRIBUTES_EXTENDED_COMMAND_ID:
    {
      EmberAfAttributeId startingAttributeId;
      uint8_t numberAttributes;
      uint8_t *complete;

      emberAfAttributesPrintln("%p%p: clus %2x", "DISC_ATTR",
                               (zclCmd == ZCL_DISCOVER_ATTRIBUTES_EXTENDED_COMMAND_ID ? "_EXT" : ""),
                               clusterId);

      // set the cmd byte - this is byte 3 index 2, but since we have
      // already incremented past the 3 byte ZCL header (our index is at 3),
      // this gets written to "-1" since 3 - 1 = 2.
      (void) emberAfPutInt8uInResp(
        (zclCmd == ZCL_DISCOVER_ATTRIBUTES_COMMAND_ID
         ? ZCL_DISCOVER_ATTRIBUTES_RESPONSE_COMMAND_ID
         : ZCL_DISCOVER_ATTRIBUTES_EXTENDED_RESPONSE_COMMAND_ID));

      // get the attrId to start on and the max count
      startingAttributeId = emberAfGetInt16u(message, msgIndex, msgLen);
      numberAttributes = emberAfGetInt8u(message, msgIndex + 2u, msgLen);

      // BUGZID: EMAPPFWKV2-828, EMAPPFWKV2-1401
      if (zclCmd == ZCL_DISCOVER_ATTRIBUTES_COMMAND_ID
          && numberAttributes > DISC_ATTR_RSP_MAX_ATTRIBUTES) {
        numberAttributes = DISC_ATTR_RSP_MAX_ATTRIBUTES;
      } else if (zclCmd == ZCL_DISCOVER_ATTRIBUTES_EXTENDED_COMMAND_ID
                 && numberAttributes > DISC_ATTR_EXT_RSP_MAX_ATTRIBUTES) {
        numberAttributes = DISC_ATTR_EXT_RSP_MAX_ATTRIBUTES;
      } else {
        // MISRA requires ..else if.. to have terminating else.
      }

      // Check for mfg-spec wildcard and resolve mfg code if necessary.
      if (cmd->mfgSpecific && cmd->mfgCode == 0xFFFFu) {
        uint16_t resolvedMfgCode
          = emAfResolveMfgCodeForDiscoverAttribute(cmd->apsFrame->destinationEndpoint,
                                                   clusterId,
                                                   startingAttributeId,
                                                   clientServerMask);
        if (resolvedMfgCode != 0xFFFFu && mfgCodePtr != NULL) {
          // (Note: retain wildcard mfg code and let it fail if not resolved.)
          // Replace wildcard mfg code in cmd for subsequent extract processing.
          cmd->mfgCode = resolvedMfgCode;
          // Write Response's mfg code field with resolved value (LE order).
          *mfgCodePtr = (uint8_t)(resolvedMfgCode & 0x00FFu);
          *(mfgCodePtr + 1) = (uint8_t)((resolvedMfgCode & 0xFF00u) >> 8);
        }
      }

      // The response has a one-byte field indicating whether discovery is
      // complete.  We can't populate that field until we've finished going
      // through all the attributes, so save a placeholder, write a temporary
      // value for now (so that the offset moves forward), and write the real
      // value when we're done.
      complete = &(appResponseData[appResponseLength]);
      (void) emberAfPutInt8uInResp(false);
      *complete = emberAfReadSequentialAttributesAddToResponse(
        cmd->apsFrame->destinationEndpoint,
        clusterId,
        startingAttributeId,
        clientServerMask,
        cmd->mfgCode,
        numberAttributes,
        (zclCmd == ZCL_DISCOVER_ATTRIBUTES_EXTENDED_COMMAND_ID));
      emberAfSendResponse();
      return true;
    }

    case ZCL_CONFIGURE_REPORTING_COMMAND_ID:
      if (emberAfConfigureReportingCommandCallback(cmd)) {
        return true;
      }
      break;

    case ZCL_READ_REPORTING_CONFIGURATION_COMMAND_ID:
      if (emberAfReadReportingConfigurationCommandCallback(cmd)) {
        return true;
      }
      break;

    // ([attribute id:2] [status:1] [type:0/1] [value:0/V])+
    case ZCL_READ_ATTRIBUTES_RESPONSE_COMMAND_ID:
      // The "timesync" command in the CLI sends a Read Attributes command for the
      // Time attribute on another device and then sets a flag.  If that flag is
      // set and a Read Attributes Response command for the time comes in, we set
      // the time to the value in the message.
      if (clusterId == ZCL_TIME_CLUSTER_ID) {
        if (emAfSyncingTime
            && !cmd->mfgSpecific
            && msgLen - msgIndex == 8u // attr:2 status:1 type:1 data:4
            && (emberAfGetInt16u(message, msgIndex, msgLen)
                == ZCL_TIME_ATTRIBUTE_ID)
            && (emberAfGetInt8u(message, msgIndex + 2u, msgLen)
                == EMBER_ZCL_STATUS_SUCCESS)
            && (emberAfGetInt8u(message, msgIndex + 3u, msgLen)
                == ZCL_UTC_TIME_ATTRIBUTE_TYPE)) {
          emberAfSetTime(emberAfGetInt32u(message, msgIndex + 4u, msgLen));
          emberAfDebugPrintln("time sync ok, time: %4x", emberAfGetCurrentTime());
          emAfSyncingTime = false;
        }
#ifdef EMBER_AF_PLUGIN_SMART_ENERGY_REGISTRATION_TIME_SOURCE_REQUIRED
        emAfPluginSmartEnergyRegistrationReadAttributesResponseCallback(message + msgIndex,
                                                                        msgLen - msgIndex);
#endif //EMBER_AF_PLUGIN_SMART_ENERGY_REGISTRATION_TIME_SOURCE_REQUIRED
#ifdef WWAH_SERVER_SILABS_PRESENT
        emAfPluginSlWwahReadAttributesResponseCallback(clusterId, message, msgLen);
#endif // WWAH_SERVER_SILABS_PRESENT
      }

#ifdef TRUST_CENTER_KEEPALIVE_PRESENT
      if (clusterId == ZCL_KEEPALIVE_CLUSTER_ID
          && !cmd->mfgSpecific) {
        emAfPluginTrustCenterKeepaliveReadAttributesResponseCallback(message + msgIndex,
                                                                     msgLen - msgIndex);
      }
#endif // TRUST_CENTER_KEEPALIVE_PRESENT

#ifdef KEY_ESTABLISHMENT_PRESENT
      if (clusterId == ZCL_KEY_ESTABLISHMENT_CLUSTER_ID
          && !cmd->mfgSpecific
          && msgLen - msgIndex == 6u //attr:2 status:1 type:1 data:2
          && (emberAfGetInt16u(message, msgIndex, msgLen)
              == ZCL_KEY_ESTABLISHMENT_SUITE_CLIENT_ATTRIBUTE_ID)
          && (emberAfGetInt8u(message, msgIndex + 2u, msgLen)
              == EMBER_ZCL_STATUS_SUCCESS)
          && ((emberAfGetInt8u(message, msgIndex + 3u, msgLen) == ZCL_ENUM16_ATTRIBUTE_TYPE)
              || (emberAfGetInt8u(message, msgIndex + 3u, msgLen) == ZCL_BITMAP16_ATTRIBUTE_TYPE))) {
        uint16_t suite = emberAfGetInt16u(message, msgIndex + 4u, msgLen);
        emberAfPluginKeyEstablishmentReadAttributesCallback(suite);
      }
#endif // KEY_ESTABLISHMENT_PRESENT

