espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/util/process-global-message.c
#ifdef TEST_HARNESS_PRESENT
      emberAfPluginTestHarnessReadAttributesResponseCallback(clusterId,
                                                             message + msgIndex,
                                                             msgLen - msgIndex);
#endif // TEST_HARNESS_PRESENT

#ifdef IAS_ZONE_CLIENT_PRESENT
      emberAfPluginIasZoneClientReadAttributesResponseCallback(clusterId,
                                                               message + msgIndex,
                                                               msgLen - msgIndex);
#endif // IAS_ZONE_CLIENT_PRESENT

#ifdef SIMPLE_METERING_SERVER_PRESENT
      emberAfPluginSimpleMeteringClusterReadAttributesResponseCallback(clusterId,
                                                                       message + msgIndex,
                                                                       msgLen - msgIndex);
#endif // SIMPLE_METERING_SERVER_PRESENT

      if (!emAfReadAttributesResponse(clusterId,
                                      message + msgIndex,
                                      msgLen - msgIndex)) {
        emberAfSendDefaultResponse(cmd, EMBER_ZCL_STATUS_SUCCESS);
      }
      return true;

    // ([status:1] [attribute id:2])+
    case ZCL_WRITE_ATTRIBUTES_RESPONSE_COMMAND_ID:

  #ifdef TEST_HARNESS_PRESENT
      emberAfPluginTestHarnessWriteAttributesResponseCallback(clusterId,
                                                              message + msgIndex,
                                                              msgLen - msgIndex);
  #endif // TEST_HARNESS_PRESENT

  #ifdef IAS_ZONE_CLIENT_PRESENT
      emberAfPluginIasZoneClientWriteAttributesResponseCallback(clusterId,
                                                                message + msgIndex,
                                                                msgLen - msgIndex);
  #endif // IAS_ZONE_CLIENT_PRESENT

      if (!emberAfWriteAttributesResponseCallback(clusterId,
                                                  message + msgIndex,
                                                  msgLen - msgIndex)) {
        emberAfSendDefaultResponse(cmd, EMBER_ZCL_STATUS_SUCCESS);
      }
      return true;

    // ([status:1] [direction:1] [attribute id:2])+
    case ZCL_CONFIGURE_REPORTING_RESPONSE_COMMAND_ID:
      if (!emberAfConfigureReportingResponseCallback(clusterId,
                                                     message + msgIndex,
                                                     msgLen - msgIndex)) {
        emberAfSendDefaultResponse(cmd, EMBER_ZCL_STATUS_SUCCESS);
      }
      return true;

    // ([status:1] [direction:1] [attribute id:2] [type:0/1] ...
    // ... [min interval:0/2] [max interval:0/2] [reportable change:0/V] ...
    // ... [timeout:0/2])+
    case ZCL_READ_REPORTING_CONFIGURATION_RESPONSE_COMMAND_ID:
      if (!emberAfReadReportingConfigurationResponseCallback(clusterId,
                                                             message + msgIndex,
                                                             msgLen - msgIndex)) {
        emberAfSendDefaultResponse(cmd, EMBER_ZCL_STATUS_SUCCESS);
      }
      return true;

    // ([attribute id:2] [type:1] [data:V])+
    case ZCL_REPORT_ATTRIBUTES_COMMAND_ID:
      if (!emAfReportAttributes(clusterId,
                                message + msgIndex,
                                msgLen - msgIndex)) {
        emberAfSendDefaultResponse(cmd, EMBER_ZCL_STATUS_SUCCESS);
      }
      return true;

    // [command id:1] [status:1]
    case ZCL_DEFAULT_RESPONSE_COMMAND_ID:
    {
      EmberAfStatus status;
      uint8_t commandId;
      commandId = emberAfGetInt8u(message, msgIndex, msgLen);
      msgIndex++;
      status = (EmberAfStatus)emberAfGetInt8u(message, msgIndex, msgLen);

      emberAfClusterDefaultResponseWithMfgCodeCallback(cmd->apsFrame->destinationEndpoint,
                                                       clusterId,
                                                       commandId,
                                                       status,
                                                       clientServerMask,
                                                       cmd->mfgCode);
      emberAfDefaultResponseCallback(clusterId, commandId, status);
      return true;
    }

    // [discovery complete:1] ([attribute id:2] [type:1])*
    case ZCL_DISCOVER_ATTRIBUTES_RESPONSE_COMMAND_ID:
    case ZCL_DISCOVER_ATTRIBUTES_EXTENDED_RESPONSE_COMMAND_ID:
    {
      bool discoveryComplete = (emberAfGetInt8u(message, msgIndex, msgLen) != 0u);
      msgIndex++;
      if (!emberAfDiscoverAttributesResponseCallback(clusterId,
                                                     discoveryComplete,
                                                     message + msgIndex,
                                                     msgLen - msgIndex,
                                                     (zclCmd
                                                      == ZCL_DISCOVER_ATTRIBUTES_EXTENDED_RESPONSE_COMMAND_ID))) {
        emberAfSendDefaultResponse(cmd, EMBER_ZCL_STATUS_SUCCESS);
      }
      return true;
    }

#ifdef EMBER_AF_SUPPORT_COMMAND_DISCOVERY
    // Command discovery takes a bit of flash because we need to add structs
    // for commands into the generated hader. Hence it's all configurable.
    case ZCL_DISCOVER_COMMANDS_RECEIVED_COMMAND_ID:
    case ZCL_DISCOVER_COMMANDS_GENERATED_COMMAND_ID:
    {
      uint8_t startCommandIdentifier = emberAfGetInt8u(message, msgIndex, msgLen);
      uint8_t maximumCommandIdentifiers = emberAfGetInt8u(message, msgIndex + 1, msgLen);
      uint16_t savedIndex;
      bool flag;

      // Ok. This is the command that matters.
      if ( zclCmd == ZCL_DISCOVER_COMMANDS_RECEIVED_COMMAND_ID ) {
        (void) emberAfPutInt8uInResp(ZCL_DISCOVER_COMMANDS_RECEIVED_RESPONSE_COMMAND_ID);
        flag = false;
      } else {
        (void) emberAfPutInt8uInResp(ZCL_DISCOVER_COMMANDS_GENERATED_RESPONSE_COMMAND_ID);
        flag = true;
      }

      // Check for mfg-spec wildcard and resolve mfg code if necessary.
      if (cmd->mfgSpecific && cmd->mfgCode == 0xFFFF) {
        uint16_t resolvedMfgCode
          = emAfResolveMfgCodeForDiscoverCommand(flag, cmd, clusterId, startCommandIdentifier);
        if (resolvedMfgCode != 0xFFFF && mfgCodePtr != NULL) {
          // (Note: retain wildcard mfg code and let it fail if not resolved.)
          // Replace wildcard mfg code in cmd for subsequent extract processing.
          cmd->mfgCode = resolvedMfgCode;
          // Write Response's mfg code field with resolved value (LE order).
          *mfgCodePtr = (uint8_t)(resolvedMfgCode & 0x00FF);
          *(mfgCodePtr + 1) = (uint8_t)((resolvedMfgCode & 0xFF00) >> 8);
        }
      }

      savedIndex = appResponseLength;
      flag = emberAfExtractCommandIds(flag,
                                      cmd,
                                      clusterId,
                                      appResponseData + appResponseLength + 1,
                                      EMBER_AF_RESPONSE_BUFFER_LEN - appResponseLength - 1,
                                      &appResponseLength,
                                      startCommandIdentifier,
                                      maximumCommandIdentifiers);
      appResponseData[savedIndex] = (flag ? 1 : 0);
      appResponseLength++;
      emberAfSendResponse();
      return true;
    }
    case ZCL_DISCOVER_COMMANDS_RECEIVED_RESPONSE_COMMAND_ID:
    {
      bool discoveryComplete = emberAfGetInt8u(message, msgIndex, msgLen);
      msgIndex++;
      if ( msgIndex <= msgLen ) {
        printDiscoverCommandsResponse(false,  // is ZCL command generated?
                                      clusterId,
                                      discoveryComplete,
                                      message + msgIndex,
                                      msgLen - msgIndex);
        if (!emberAfDiscoverCommandsReceivedResponseCallback(clusterId,
                                                             cmd->mfgCode,
                                                             discoveryComplete,
                                                             message + msgIndex,
                                                             msgLen - msgIndex)) {
          emberAfSendDefaultResponse(cmd, EMBER_ZCL_STATUS_SUCCESS);
        }
        return true;
      } else {
        return false;
      }
    }
    case ZCL_DISCOVER_COMMANDS_GENERATED_RESPONSE_COMMAND_ID:
    {
      bool discoveryComplete = emberAfGetInt8u(message, msgIndex, msgLen);
      msgIndex++;
      if ( msgIndex <= msgLen ) {
        printDiscoverCommandsResponse(true,  // is ZCL command generated?
                                      clusterId,
                                      discoveryComplete,
                                      message + msgIndex,
                                      msgLen - msgIndex);
        if (!emberAfDiscoverCommandsGeneratedResponseCallback(clusterId,
                                                              cmd->mfgCode,
                                                              discoveryComplete,
                                                              message + msgIndex,
                                                              msgLen - msgIndex)) {
          emberAfSendDefaultResponse(cmd, EMBER_ZCL_STATUS_SUCCESS);
        }
        return true;
      } else {
        return false;
      }
    }

#endif
    default:
      // MISRA requires default case.
      break;
  }

  kickout:
  emberAfSendDefaultResponse(cmd, EMBER_ZCL_STATUS_UNSUP_COMMAND);
  return true;
}
